In [545]:
#Check the current working directory
import os
os.getcwd()

'/Users/aakashsingla'

In [546]:
import sqlite3

In [547]:
conn= sqlite3.connect('/Users/aakashsingla/BMM2002.db')

In [548]:
conn.execute("PRAGMA foreign_keys= 1")

In [549]:
#Set the cursor 
cur=conn.cursor()

In [550]:
cur

# Add tables in above created database

In [551]:
query= '''

CREATE TABLE IF NOT EXISTS Student (S_ID INTEGER PRIMARY KEY AUTOINCREMENT, F_Name TEXT (1, 20) NOT NULL, 
                      L_NAME TEXT (1, 20), S_Email TEXT (1, 50) NOT NULL, S_Phone INTEGER (10) NOT NULL,
                      S_Add TEXT (1, 50) NOT NULL);

CREATE TABLE IF NOT EXISTS Hostel (H_ID INTEGER PRIMARY KEY, H_Name TEXT (1, 10) NOT NULL, 
                     H_Phone INTEGER (10) NOT NULL, H_Email TEXT (1, 50) NOT NULL);


CREATE TABLE IF NOT EXISTS Room (R_ID INTEGER PRIMARY KEY AUTOINCREMENT, R_Price DECIMAL (4) NOT NULL, 
                   R_Type TEXT (10) NOT NULL, R_Status TEXT (10), 
                   H_ID INTEGER REFERENCES Hostel (H_ID) ON DELETE NO ACTION ON UPDATE CASCADE);


CREATE TABLE IF NOT EXISTS Booking (B_ID INTEGER PRIMARY KEY AUTOINCREMENT, 
                      S_ID INTEGER REFERENCES Student (S_ID) ON DELETE NO ACTION ON UPDATE CASCADE,
                      R_ID INTEGER REFERENCES Room (R_ID) ON DELETE NO ACTION ON UPDATE CASCADE, 
                      Check_In DATE NOT NULL,
                      Check_Out DATE);

CREATE TABLE IF NOT EXISTS Payment (Pay_ID INTEGER PRIMARY KEY AUTOINCREMENT,
                      B_ID INTEGER REFERENCES Booking (B_ID) ON DELETE NO ACTION ON UPDATE CASCADE, Pay_Date DATE, 
                      Pay_Desc TEXT (2, 50), Pay_Amount INTEGER (2, 4));

CREATE TABLE IF NOT EXISTS Warden (W_ID INTEGER PRIMARY KEY, W_Name TEXT (1, 50) NOT NULL, W_Email TEXT (1, 50) NOT NULL,
                     W_Phone INTEGER (1, 50) NOT NULL, W_Add TEXT (1, 50) NOT NULL,
                     H_ID INTEGER REFERENCES Hostel (H_ID) ON DELETE NO ACTION ON UPDATE CASCADE);



'''
try:
    cur.executescript(query)   ## to execute the multiple queries otherswise 
                              ## we will use cursor.execute.
    print('Tables are created ')

    
    
except:
    print ("Error in creating in tables")

Tables are created

Once we have created the structure of our db by using DDL.
Now, we will use Insert query to fill thw records.

In [552]:
query= "INSERT INTO Student (S_ID, F_Name, L_NAME, S_Email, S_Phone, S_Add ) VALUES (?,?,?,?,?,?);"

students= [(700000021,'Steveson','Ramis','steve1@hmail.com','01632 960043' ,"'23, TQR 33Y'"),
          (700000043,'Mann','Sonia','manns@ymail.com','01632 960398',"'84, ST2 5RB'"),
          (700000045,'Thomas','England','thomase33@hmail.com','01632 960427',"'54, Khajoor gali, TQL 43G'"),
          (700000055,'Dafydd','Hollen','daf1@ymail.com','01632 960442',"'31, Northeren Hay,  EX4 65T'"),
          (700000061,'Ninja','Chau','n1121@hmail.com','01632  960873',"'654, Mansion LD2 2HY'"),
          (700000066,'Emile','Naina','emile2@ymail.com','01632 960608',"'457, Anaj Mandi,  SH3 7HD'"),
          (700000067,'Robert','Nakamuki','robert@hmail.com','01632 960608',"'188, BR1 1YS'"),
          (700000069,'Zola','Sharma','Zol243@hmail.com','01632 960700',"'Flat 201,  Building-A LN2 3TY'"),
          (700000070,'ApGwilym','Biggins','apb98@hmail.com','01632 960823',"'786, NC5 71E'"),
          (700000089,'Dickens','Lazos','dic213@hmail.com','01632 960000',"'320,TC1 3YU'"),
          (700000098,'Charles','Pille','charles121@hmail.com','01632 960250',"'120, EX4 3RY'"),
          (700000639,'Diljit','Grewal','diljit88@hmail.com','01632 960211',"'34, KH1 DG4'")
    
         
]

cur.executemany(query,students)
conn.commit()

# Read the entered data

In [553]:
query = "select * from student;"

In [554]:
cur.execute(query)

In [555]:
x=cur.fetchall()

In [556]:
for x in x:
    print(x)

(700000021, 'Steveson', 'Ramis', 'steve1@hmail.com', '01632 960043', "'23, TQR 33Y'")
(700000043, 'Mann', 'Sonia', 'manns@ymail.com', '01632 960398', "'84, ST2 5RB'")
(700000045, 'Thomas', 'England', 'thomase33@hmail.com', '01632 960427', "'54, Khajoor gali, TQL 43G'")
(700000055, 'Dafydd', 'Hollen', 'daf1@ymail.com', '01632 960442', "'31, Northeren Hay,  EX4 65T'")
(700000061, 'Ninja', 'Chau', 'n1121@hmail.com', '01632  960873', "'654, Mansion LD2 2HY'")
(700000066, 'Emile', 'Naina', 'emile2@ymail.com', '01632 960608', "'457, Anaj Mandi,  SH3 7HD'")
(700000067, 'Robert', 'Nakamuki', 'robert@hmail.com', '01632 960608', "'188, BR1 1YS'")
(700000069, 'Zola', 'Sharma', 'Zol243@hmail.com', '01632 960700', "'Flat 201,  Building-A LN2 3TY'")
(700000070, 'ApGwilym', 'Biggins', 'apb98@hmail.com', '01632 960823', "'786, NC5 71E'")
(700000089, 'Dickens', 'Lazos', 'dic213@hmail.com', '01632 960000', "'320,TC1 3YU'")
(700000098, 'Charles', 'Pille', 'charles121@hmail.com', '01632 960250', "'120, EX4 3RY'")
(700000639, 'Diljit', 'Grewal', 'diljit88@hmail.com', '01632 960211', "'34, KH1 DG4'")

In [557]:
# Insert for Hostel table
query= "INSERT INTO Hostel(H_ID,H_Name,H_Phone,H_Email) VALUES(141,'Matri Chaya','1755 245410','matrichaya@gmail.com');"
cur.execute(query)
conn.commit()

In [558]:
#Fetch the data for  hostel Table
query= "Select * from Hostel"
cur.execute(query)
values=cur.fetchall()
for y in values:
    print(y)

(141, 'Matri Chaya', '1755 245410', 'matrichaya@gmail.com')

In [559]:
#Insert records for  Room Table

query= "INSERT INTO Room(R_ID, R_Price, R_Type, R_Status,H_ID) VALUES(?,?,?,?,?);"
Room = [(201,5399,'Non-Ensuite','Vaccant',141),
        (202,5399,'Non-Ensuite','Vaccant',141),
       (203,5399,'Non-Ensuite','Vaccant',141),
       (204,5399,'Non-Ensuite','Vaccant',141),
       (205,5399,'Non-Ensuite','Vaccant',141),
       (206,5399,'Non-Ensuite','Booked',141),
       (301,5999,'Ensuite','Vaccant',141),
       (207,5399,'Non-Ensuite','Vaccant',141),
       (302,5999,'Ensuite','Vaccant',141),
       (303,5999,'Ensuite','Booked',141),
       (304,5999,'Ensuite','Vaccant',141),
       (305,5999,'Ensuite','Vaccant',141),
       (2033,0,'Extra','Vaccant',141),
       (3033,0,'Extra','Vaccant',141),
       (208,5399,'Non-Ensuite','Booked',141),
       (209,5399,'Non-Ensuite','Vaccant',141),
       (210,5399,'Non-Ensuite','Vaccant',141),
       (211,5399,'Non-Ensuite','Booked',141),
       (306,5999,'Ensuite','Vaccant',141),
       (307,5999,'Ensuite','Vaccant',141),
       (308,5999,'Ensuite','Booked',141),
       (309,5999,'Ensuite','Vaccant',141),
       (310,5999,'Ensuite','Vaccant',141)]
     

cur.executemany(query,Room)
conn.commit()

In [560]:
#Fetch the data for  Room Table
query= "Select * from Room"
cur.execute(query)
values=cur.fetchall()
for y in values:
    print(y)

(201, 5399, 'Non-Ensuite', 'Vaccant', 141)
(202, 5399, 'Non-Ensuite', 'Vaccant', 141)
(203, 5399, 'Non-Ensuite', 'Vaccant', 141)
(204, 5399, 'Non-Ensuite', 'Vaccant', 141)
(205, 5399, 'Non-Ensuite', 'Vaccant', 141)
(206, 5399, 'Non-Ensuite', 'Booked', 141)
(207, 5399, 'Non-Ensuite', 'Vaccant', 141)
(208, 5399, 'Non-Ensuite', 'Booked', 141)
(209, 5399, 'Non-Ensuite', 'Vaccant', 141)
(210, 5399, 'Non-Ensuite', 'Vaccant', 141)
(211, 5399, 'Non-Ensuite', 'Booked', 141)
(301, 5999, 'Ensuite', 'Vaccant', 141)
(302, 5999, 'Ensuite', 'Vaccant', 141)
(303, 5999, 'Ensuite', 'Booked', 141)
(304, 5999, 'Ensuite', 'Vaccant', 141)
(305, 5999, 'Ensuite', 'Vaccant', 141)
(306, 5999, 'Ensuite', 'Vaccant', 141)
(307, 5999, 'Ensuite', 'Vaccant', 141)
(308, 5999, 'Ensuite', 'Booked', 141)
(309, 5999, 'Ensuite', 'Vaccant', 141)
(310, 5999, 'Ensuite', 'Vaccant', 141)
(2033, 0, 'Extra', 'Vaccant', 141)
(3033, 0, 'Extra', 'Vaccant', 141)

In [561]:
query= "INSERT INTO Booking(B_ID, S_ID, R_ID, Check_In,Check_Out) VALUES(?,?,?,?,?);"
booking=[(99999901,700000061,301,'20/05/2021','19/04/2022'),
         (99999902,700000021,203,'28/05/2021','19/04/2022'),
         (99999903,700000043,302,'31/05/2021','19/04/2022'),
         (99999904,700000045,206,'16/04/2021','19/04/2022'),
         (99999905,700000055,303,'20/05/2021','19/04/2022'),
        
    
]
cur.executemany(query,booking)
conn.commit()

In [562]:
#Fetch the data for  Booking Table

query="Select * from Booking"
cur.execute(query)
value= cur.fetchall()
for x in value:
    print(x)

(99999901, 700000061, 301, '20/05/2021', '19/04/2022')
(99999902, 700000021, 203, '28/05/2021', '19/04/2022')
(99999903, 700000043, 302, '31/05/2021', '19/04/2022')
(99999904, 700000045, 206, '16/04/2021', '19/04/2022')
(99999905, 700000055, 303, '20/05/2021', '19/04/2022')

In [563]:
#we can also take command from user

read= input("Enter the Booking id:")
query= "select * from Booking where B_ID= ?;"

cur.execute(query, (read,))
result= cur.fetchall()

print("Records of:", result)

Enter the Booking id:
Records of: []

In [564]:
#Insert values into payment table

query= "INSERT INTO Payment (Pay_ID, B_ID,Pay_Date,Pay_Desc, Pay_Amount) VALUES(?,?,?,?,?);"
payment= [(1121,99999901,'03/2021','Success',2000),
          (1122,99999902,'03/2021','Success',2000),
          (1123,99999903,'04/2021','Success',1800),
          (1124,99999904,'04/2021','Success',2500),
          (1125,99999905,'03/2021','Failed',0),
          (1126,99999901,'04/2021','Failed',0),
          (1127,99999902,'03/2021','Success',2850),
          (1128,99999903,'04/2021','Success',2000),
          (1129,99999904,'03/2021','Failed',0),
          (1130,99999904,'04/2021','Success',2250),
          (1132,99999902,'04/2021','Success',2000),
          (1133,99999901,'04/2021','Failed',0)
    
    
]
cur.executemany(query,payment)
conn.commit()

In [565]:
### Fetch the data for  Payment Table

query="Select * from Payment"
cur.execute(query)
value= cur.fetchall()
for x in value:
    print(x)

(1121, 99999901, '03/2021', 'Success', 2000)
(1122, 99999902, '03/2021', 'Success', 2000)
(1123, 99999903, '04/2021', 'Success', 1800)
(1124, 99999904, '04/2021', 'Success', 2500)
(1125, 99999905, '03/2021', 'Failed', 0)
(1126, 99999901, '04/2021', 'Failed', 0)
(1127, 99999902, '03/2021', 'Success', 2850)
(1128, 99999903, '04/2021', 'Success', 2000)
(1129, 99999904, '03/2021', 'Failed', 0)
(1130, 99999904, '04/2021', 'Success', 2250)
(1132, 99999902, '04/2021', 'Success', 2000)
(1133, 99999901, '04/2021', 'Failed', 0)

In [566]:
#Insert values into warden table

query= "INSERT INTO Warden(W_ID, W_Name, W_Email, W_Phone, W_Add, H_ID) VALUES(?,?,?,?,?,?);"
warden= [(301,'Tim Morris','tim11@onestudent.com',132667766,"'12, Cambrige CM1,  4RT'",141),
         (302,'Andy Thomas','Andy@onestudent.com',132244678,"'44,  Torquay TQ1 RS9'",141)

]
cur.executemany(query,warden)
conn.commit()

In [567]:
#Fetch the data for  Warden Table
query="Select * from Warden"
cur.execute(query)
value= cur.fetchall()
for x in value:
    print(x)

(301, 'Tim Morris', 'tim11@onestudent.com', 132667766, "'12, Cambrige CM1,  4RT'", 141)
(302, 'Andy Thomas', 'Andy@onestudent.com', 132244678, "'44,  Torquay TQ1 RS9'", 141)

# For the next year, the prices are going to be increased by 10%. Here we will perform CRUD functions.

In [568]:
query=''' 

update Room set R_Price= R_Price + (R_Price*.1);

'''

try:
    cur.execute(query)
    print ('Prices updated!')
    conn.commit()
except:
    conn.rollback()
    print ("Rollback the prices")

Prices updated!

In [569]:

query= "Select * from Room"
cur.execute(query)
updated_values= cur.fetchall()
for room in updated_values:
    print(room)

(201, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(202, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(203, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(204, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(205, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(206, 5938.9, 'Non-Ensuite', 'Booked', 141)
(207, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(208, 5938.9, 'Non-Ensuite', 'Booked', 141)
(209, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(210, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(211, 5938.9, 'Non-Ensuite', 'Booked', 141)
(301, 6598.9, 'Ensuite', 'Vaccant', 141)
(302, 6598.9, 'Ensuite', 'Vaccant', 141)
(303, 6598.9, 'Ensuite', 'Booked', 141)
(304, 6598.9, 'Ensuite', 'Vaccant', 141)
(305, 6598.9, 'Ensuite', 'Vaccant', 141)
(306, 6598.9, 'Ensuite', 'Vaccant', 141)
(307, 6598.9, 'Ensuite', 'Vaccant', 141)
(308, 6598.9, 'Ensuite', 'Booked', 141)
(309, 6598.9, 'Ensuite', 'Vaccant', 141)
(310, 6598.9, 'Ensuite', 'Vaccant', 141)
(2033, 0, 'Extra', 'Vaccant', 141)
(3033, 0, 'Extra', 'Vaccant', 141)

One student who cancelled his registration, so we are deleting his payment record. Then we can only delete his booking. But we still want to keep his record in our database for future reference and booking.

In [570]:
query= '''

Delete from Payment where Pay_ID = 1125;


'''
try:
    cur.execute(query)
    conn.commit()
    print("Record deleted succesfully")
    
except:
    conn.rollback()
    print("changes failed and rollbacked again")

Record deleted succesfully

In [571]:
query='''

select * from payment 

'''
cur.execute(query)
values=cur.fetchall()
for x in values:
    print(x) ##1125 will be deleted from records

(1121, 99999901, '03/2021', 'Success', 2000)
(1122, 99999902, '03/2021', 'Success', 2000)
(1123, 99999903, '04/2021', 'Success', 1800)
(1124, 99999904, '04/2021', 'Success', 2500)
(1126, 99999901, '04/2021', 'Failed', 0)
(1127, 99999902, '03/2021', 'Success', 2850)
(1128, 99999903, '04/2021', 'Success', 2000)
(1129, 99999904, '03/2021', 'Failed', 0)
(1130, 99999904, '04/2021', 'Success', 2250)
(1132, 99999902, '04/2021', 'Success', 2000)
(1133, 99999901, '04/2021', 'Failed', 0)

In [572]:
#after deleting from child table, we can delete from parent table
query= '''

Delete from Booking where B_ID = 99999905;

'''
cur.execute(query)
conn.commit()

In [573]:
query= "select * from booking"
cur.execute(query)
n= cur.fetchall()
for x in n:
    print(x)

(99999901, 700000061, 301, '20/05/2021', '19/04/2022')
(99999902, 700000021, 203, '28/05/2021', '19/04/2022')
(99999903, 700000043, 302, '31/05/2021', '19/04/2022')
(99999904, 700000045, 206, '16/04/2021', '19/04/2022')

In [574]:
query= "update room set R_Status= 'Vaccant'  where R_ID= 303;"

cur.execute(query)
query= "select * from Room"
cur.execute(query)
value= cur.fetchall()

for values in  value:
    print(values)

(201, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(202, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(203, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(204, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(205, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(206, 5938.9, 'Non-Ensuite', 'Booked', 141)
(207, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(208, 5938.9, 'Non-Ensuite', 'Booked', 141)
(209, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(210, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(211, 5938.9, 'Non-Ensuite', 'Booked', 141)
(301, 6598.9, 'Ensuite', 'Vaccant', 141)
(302, 6598.9, 'Ensuite', 'Vaccant', 141)
(303, 6598.9, 'Ensuite', 'Vaccant', 141)
(304, 6598.9, 'Ensuite', 'Vaccant', 141)
(305, 6598.9, 'Ensuite', 'Vaccant', 141)
(306, 6598.9, 'Ensuite', 'Vaccant', 141)
(307, 6598.9, 'Ensuite', 'Vaccant', 141)
(308, 6598.9, 'Ensuite', 'Booked', 141)
(309, 6598.9, 'Ensuite', 'Vaccant', 141)
(310, 6598.9, 'Ensuite', 'Vaccant', 141)
(2033, 0, 'Extra', 'Vaccant', 141)
(3033, 0, 'Extra', 'Vaccant', 141)

In [575]:

import pandas as pd

# No-SQL Redis

In [576]:
#pip install redis

In [577]:
import redis

In [578]:
r= redis.Redis(host='localhost', port=6379, db=5) #USE the Database number 5
print(r.ping())

True

In [579]:
for room in updated_values:
    print (room)

(201, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(202, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(203, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(204, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(205, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(206, 5938.9, 'Non-Ensuite', 'Booked', 141)
(207, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(208, 5938.9, 'Non-Ensuite', 'Booked', 141)
(209, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(210, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(211, 5938.9, 'Non-Ensuite', 'Booked', 141)
(301, 6598.9, 'Ensuite', 'Vaccant', 141)
(302, 6598.9, 'Ensuite', 'Vaccant', 141)
(303, 6598.9, 'Ensuite', 'Booked', 141)
(304, 6598.9, 'Ensuite', 'Vaccant', 141)
(305, 6598.9, 'Ensuite', 'Vaccant', 141)
(306, 6598.9, 'Ensuite', 'Vaccant', 141)
(307, 6598.9, 'Ensuite', 'Vaccant', 141)
(308, 6598.9, 'Ensuite', 'Booked', 141)
(309, 6598.9, 'Ensuite', 'Vaccant', 141)
(310, 6598.9, 'Ensuite', 'Vaccant', 141)
(2033, 0, 'Extra', 'Vaccant', 141)
(3033, 0, 'Extra', 'Vaccant', 141)

In [580]:
# filter all the vacant rooms
query= "select * from Room where R_ID between 200 and 400 And R_Status= 'Vaccant'; "
cur.execute(query)
values=cur.fetchall()
for x in values:
    print(x)

(201, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(202, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(203, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(204, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(205, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(207, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(209, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(210, 5938.9, 'Non-Ensuite', 'Vaccant', 141)
(301, 6598.9, 'Ensuite', 'Vaccant', 141)
(302, 6598.9, 'Ensuite', 'Vaccant', 141)
(303, 6598.9, 'Ensuite', 'Vaccant', 141)
(304, 6598.9, 'Ensuite', 'Vaccant', 141)
(305, 6598.9, 'Ensuite', 'Vaccant', 141)
(306, 6598.9, 'Ensuite', 'Vaccant', 141)
(307, 6598.9, 'Ensuite', 'Vaccant', 141)
(309, 6598.9, 'Ensuite', 'Vaccant', 141)
(310, 6598.9, 'Ensuite', 'Vaccant', 141)

In [581]:
#Since, we only adverstise  those rooms which are available for students.
#The other two rooms are being used by management in case of emergency.

In [582]:

DF= pd.DataFrame(values, columns=["R_ID", "R_Price",'R_Type',"R_Status","H_ID"])
DF

    R_ID  R_Price       R_Type R_Status  H_ID
0    201   5938.9  Non-Ensuite  Vaccant   141
1    202   5938.9  Non-Ensuite  Vaccant   141
2    203   5938.9  Non-Ensuite  Vaccant   141
3    204   5938.9  Non-Ensuite  Vaccant   141
4    205   5938.9  Non-Ensuite  Vaccant   141
5    207   5938.9  Non-Ensuite  Vaccant   141
6    209   5938.9  Non-Ensuite  Vaccant   141
7    210   5938.9  Non-Ensuite  Vaccant   141
8    301   6598.9      Ensuite  Vaccant   141
9    302   6598.9      Ensuite  Vaccant   141
10   303   6598.9      Ensuite  Vaccant   141
11   304   6598.9      Ensuite  Vaccant   141
12   305   6598.9      Ensuite  Vaccant   141
13   306   6598.9      Ensuite  Vaccant   141
14   307   6598.9      Ensuite  Vaccant   141
15   309   6598.9      Ensuite  Vaccant   141
16   310   6598.9      Ensuite  Vaccant   141

In [583]:
print(DF)

    R_ID  R_Price       R_Type R_Status  H_ID
0    201   5938.9  Non-Ensuite  Vaccant   141
1    202   5938.9  Non-Ensuite  Vaccant   141
2    203   5938.9  Non-Ensuite  Vaccant   141
3    204   5938.9  Non-Ensuite  Vaccant   141
4    205   5938.9  Non-Ensuite  Vaccant   141
5    207   5938.9  Non-Ensuite  Vaccant   141
6    209   5938.9  Non-Ensuite  Vaccant   141
7    210   5938.9  Non-Ensuite  Vaccant   141
8    301   6598.9      Ensuite  Vaccant   141
9    302   6598.9      Ensuite  Vaccant   141
10   303   6598.9      Ensuite  Vaccant   141
11   304   6598.9      Ensuite  Vaccant   141
12   305   6598.9      Ensuite  Vaccant   141
13   306   6598.9      Ensuite  Vaccant   141
14   307   6598.9      Ensuite  Vaccant   141
15   309   6598.9      Ensuite  Vaccant   141
16   310   6598.9      Ensuite  Vaccant   141

In [584]:

DF['R_ID']= "Room:" +DF['R_ID'].astype(str)
DF

        R_ID  R_Price       R_Type R_Status  H_ID
0   Room:201   5938.9  Non-Ensuite  Vaccant   141
1   Room:202   5938.9  Non-Ensuite  Vaccant   141
2   Room:203   5938.9  Non-Ensuite  Vaccant   141
3   Room:204   5938.9  Non-Ensuite  Vaccant   141
4   Room:205   5938.9  Non-Ensuite  Vaccant   141
5   Room:207   5938.9  Non-Ensuite  Vaccant   141
6   Room:209   5938.9  Non-Ensuite  Vaccant   141
7   Room:210   5938.9  Non-Ensuite  Vaccant   141
8   Room:301   6598.9      Ensuite  Vaccant   141
9   Room:302   6598.9      Ensuite  Vaccant   141
10  Room:303   6598.9      Ensuite  Vaccant   141
11  Room:304   6598.9      Ensuite  Vaccant   141
12  Room:305   6598.9      Ensuite  Vaccant   141
13  Room:306   6598.9      Ensuite  Vaccant   141
14  Room:307   6598.9      Ensuite  Vaccant   141
15  Room:309   6598.9      Ensuite  Vaccant   141
16  Room:310   6598.9      Ensuite  Vaccant   141

In [585]:
DF['R_ID_INDEX']=DF['R_ID']
DF

        R_ID  R_Price       R_Type R_Status  H_ID R_ID_INDEX
0   Room:201   5938.9  Non-Ensuite  Vaccant   141   Room:201
1   Room:202   5938.9  Non-Ensuite  Vaccant   141   Room:202
2   Room:203   5938.9  Non-Ensuite  Vaccant   141   Room:203
3   Room:204   5938.9  Non-Ensuite  Vaccant   141   Room:204
4   Room:205   5938.9  Non-Ensuite  Vaccant   141   Room:205
5   Room:207   5938.9  Non-Ensuite  Vaccant   141   Room:207
6   Room:209   5938.9  Non-Ensuite  Vaccant   141   Room:209
7   Room:210   5938.9  Non-Ensuite  Vaccant   141   Room:210
8   Room:301   6598.9      Ensuite  Vaccant   141   Room:301
9   Room:302   6598.9      Ensuite  Vaccant   141   Room:302
10  Room:303   6598.9      Ensuite  Vaccant   141   Room:303
11  Room:304   6598.9      Ensuite  Vaccant   141   Room:304
12  Room:305   6598.9      Ensuite  Vaccant   141   Room:305
13  Room:306   6598.9      Ensuite  Vaccant   141   Room:306
14  Room:307   6598.9      Ensuite  Vaccant   141   Room:307
15  Room:309   6598.9      Ensuite  Vaccant   141   Room:309
16  Room:310   6598.9      Ensuite  Vaccant   141   Room:310

In [586]:
#DF.drop('index',axis=1,inplace=True)

In [587]:
DF.set_index('R_ID_INDEX', inplace=True)# in order to make R_ID_Index column as index,
                                    #we have used set index command

In [588]:
DF['R_ID']=DF['R_ID'].str.slice(5,9)

In [589]:
DF

           R_ID  R_Price       R_Type R_Status  H_ID
R_ID_INDEX
Room:201    201   5938.9  Non-Ensuite  Vaccant   141
Room:202    202   5938.9  Non-Ensuite  Vaccant   141
Room:203    203   5938.9  Non-Ensuite  Vaccant   141
Room:204    204   5938.9  Non-Ensuite  Vaccant   141
Room:205    205   5938.9  Non-Ensuite  Vaccant   141
Room:207    207   5938.9  Non-Ensuite  Vaccant   141
Room:209    209   5938.9  Non-Ensuite  Vaccant   141
Room:210    210   5938.9  Non-Ensuite  Vaccant   141
Room:301    301   6598.9      Ensuite  Vaccant   141
Room:302    302   6598.9      Ensuite  Vaccant   141
Room:303    303   6598.9      Ensuite  Vaccant   141
Room:304    304   6598.9      Ensuite  Vaccant   141
Room:305    305   6598.9      Ensuite  Vaccant   141
Room:306    306   6598.9      Ensuite  Vaccant   141
Room:307    307   6598.9      Ensuite  Vaccant   141
Room:309    309   6598.9      Ensuite  Vaccant   141
Room:310    310   6598.9      Ensuite  Vaccant   141

# If you want to book a room, this is the list of all availble rooms.

In [590]:
DF=DF.to_dict('index') #convert the dataframe to dictonary

In [591]:
DF.keys()

dict_keys(['Room:201', 'Room:202', 'Room:203', 'Room:204', 'Room:205', 'Room:207', 'Room:209', 'Room:210', 'Room:301', 'Room:302', 'Room:303', 'Room:304', 'Room:305', 'Room:306', 'Room:307', 'Room:309', 'Room:310'])

In [592]:
r = redis.Redis(host='localhost', port=6379, db=5, charset="utf-8", decode_responses=True)
#call the redis with database number 5 and string decode

In [593]:
DF.values()

dict_values([{'R_ID': '201', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '202', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '203', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '204', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '205', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '207', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '209', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '210', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '301', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '302', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '303', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '304', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '305', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '306', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '307', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '309', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}, {'R_ID': '310', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}])

In [594]:
## we have two values in DF.items
## therefore we have defined two variables 
## Also, there are multiple keys in items thats why we used mset for hash keys.

with r.pipeline() as pipe:
    for R_ID, R_Details in DF.items():
        pipe.hmset(R_ID, R_Details)
        print("Room ID:", R_ID,"Room Details: ", R_Details)
    pipe.execute()

Room ID: Room:201 Room Details:  {'R_ID': '201', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:202 Room Details:  {'R_ID': '202', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:203 Room Details:  {'R_ID': '203', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:204 Room Details:  {'R_ID': '204', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:205 Room Details:  {'R_ID': '205', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:207 Room Details:  {'R_ID': '207', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:209 Room Details:  {'R_ID': '209', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:210 Room Details:  {'R_ID': '210', 'R_Price': 5938.9, 'R_Type': 'Non-Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:301 Room Details:  {'R_ID': '301', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:302 Room Details:  {'R_ID': '302', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:303 Room Details:  {'R_ID': '303', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:304 Room Details:  {'R_ID': '304', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:305 Room Details:  {'R_ID': '305', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:306 Room Details:  {'R_ID': '306', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:307 Room Details:  {'R_ID': '307', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:309 Room Details:  {'R_ID': '309', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}
Room ID: Room:310 Room Details:  {'R_ID': '310', 'R_Price': 6598.9, 'R_Type': 'Ensuite', 'R_Status': 'Vaccant', 'H_ID': 141}

<ipython-input-594-3d48e84418ac>:7: DeprecationWarning: Pipeline.hmset() is deprecated. Use Pipeline.hset() instead.
  pipe.hmset(R_ID, R_Details)

In [595]:
r.bgsave()

True

In [596]:
r.keys()# to check all the keys

['Room:207',
 'Room:310',
 'Room:210',
 'Room:305',
 'Room:205',
 'Room:307',
 'Room:309',
 'Room:301',
 'Room:306',
 'Room:304',
 'Room:209',
 'Room:302',
 'Room:204',
 'Room:201',
 'Room:303',
 'Room:202',
 'Room:203']

# Read of Redis data

In [597]:
r.hgetall("Room:302")

{'R_Price': '6598.9',
 'R_Type': 'Ensuite',
 'R_Status': 'Vaccant',
 'H_ID': '141',
 'R_ID': '302'}

In [598]:
#Update command
r.hset("Room:302","R_Status", "Booked")

0

In [599]:
#Read again to check the status
r.hgetall("Room:302")

{'R_Price': '6598.9',
 'R_Type': 'Ensuite',
 'R_Status': 'Booked',
 'H_ID': '141',
 'R_ID': '302'}

In [600]:
#delete command
r.delete("Room:307")

1

In [601]:
#Read the data
r.hgetall("Room:307")

{}

# Polyglot Persistence

In [602]:
x=309
tb = 'Room:'+str(x)
r.hset(tb,"R_Status", "Vaccant")

0

In [603]:
#To check whether room is booked or not?
def BookingExists1(RID):
    x=0
    query="select R_status from Room where R_ID = ?"
    out = cur.execute(query,(RID,)).fetchall()
    print(out[0][0])
    if out[0][0]=='Booked':
        return True
        
    else:
        return False

In [604]:
BookingExists1(302)

Vaccant

False

In [605]:
#This will update the status of room table as well as redis hash keys
def Room1(x):
    query="update Room set R_Status= 'Booked' where R_ID= ?;"
    cur.execute(query,(x,))
    conn.commit()
    
    #reddis
    tb = 'Room:'+str(x)
    r.hset(tb,"R_Status", "Booked")
    
    print ("Room Booked")

In [606]:
#User will enter the room which he wants to book. if is already booked, it won't make changes otherwise,
#we will be able to update the data into room table as well as redis. 

def completebooking():
    RoomID= input("Enter the room ID:")
    if BookingExists1(RoomID)== False:
        Room1(RoomID)

    else:
        print("you can't book it again")

In [607]:
completebooking() #try with any vaccant ids for instance 302

Enter the room ID:204
Vaccant
Room Booked

In [609]:
#Status in Redis is also changed for the same key

print(r.hgetall("Room:204"))

{'R_ID': '204', 'R_Price': '5938.9', 'R_Type': 'Non-Ensuite', 'R_Status': 'Booked', 'H_ID': '141'}

In [610]:
r.bgsave()

True

In [611]:
conn.close()